Pandas Tutorial Stuff

In [10]:
import pandas as pd

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [5]:
x = df[["ID"]]
x
type(x)

pandas.core.frame.DataFrame

In [7]:
z = df[['Department', 'Salary', "ID"]]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

Challanges

In [9]:
x = {'Student': ['David', 'Samuel', 'Terry', 'Evan'], 'Age': ['27', '24', '22','32'], 'Country': ['UK', 'Canada', 'China', 'USA'], 'Course': ['Python','Data Structures', 'Machine Learning', 'Web Development'], 'Marks': ['85', '72', '89', '76']}
df1 = pd.DataFrame(x)
df1

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [11]:
b = df1[["Marks"]]
b

  Marks
0    85
1    72
2    89
3    76

In [12]:
c = df1[["Country", "Course"]]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

Pandas Tutorial Pt 2

In [14]:
df.iloc[0, 0]

'Rose'

In [15]:
df.iloc[0,2]

'Architect Group'

In [18]:
df.loc[0, 'Salary']

100000

In [31]:
df2 = df
df2 = df2.set_index("Name")
df2

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [27]:
df2.head

<bound method NDFrame.head of       ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000>

In [22]:
df2.loc['Jane', 'Salary']

50000

Challanges Pt 2

In [32]:
df2.loc["Jane", "Department"]

'Design Team'

In [35]:
df2.iloc[3,2]

60000

Pandas Tutorial Pt 3

In [40]:
df.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [45]:
df.loc[0:2, 'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [46]:
df2.loc['Rose':'Jane', 'ID':'Department']

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team

Part 3 Challanges

In [47]:
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [51]:
df.loc[2:3, 'Name': 'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure